{
  "backend/main.mo": "Defines data types for moods, chat, analytics, user profiles, market metadata, and comparisons for sorting entries. Serves as the backend actor’s core type and model definitions.",
  "feature_evidence.json": "Contains feature evidence records mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries of numerous frontend files including components, hooks, and config files.",
  "frontend/index.css": "Defines global Tailwind base styles with OKLCH color variables, light/dark theme tokens, and default element styling.",
  "frontend/index.html": "Minimal HTML entry point that loads the React application through main.tsx.",
  "frontend/src/App.tsx": "Main React app container handling authentication, profile setup, routing between views, and session/activity tracking.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Admin panel component that loads a user's record and displays details, mood statistics, and tabbed drilldown views with loading and error states.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Shows a user's mood history using calendar and chart views, with date selection and mood trend visualizations.",
  "frontend/src/components/AIChat.tsx": "Implements the AI chat interface with session‑scoped message history, auto‑scrolling, typing simulation, and rule‑based AI responses.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Admin analytics dashboard that loads app-wide metrics, user records, admin status, and allows inspecting individual users and downloading an analysis script.",
  "frontend/src/components/AnonymousLogin.tsx": "Handles Internet Identity and guest login flows, user profile setup, and error handling before calling back with the authenticated user.",
  "frontend/src/components/AppMarketSettings.tsx": "UI for editing app listing metadata, pricing configuration, and viewing market analytics with save actions.",
  "frontend/src/components/ChatRoom.tsx": "Renders a chat room UI with message fetching, auto‑scrolling, message sending, and room metadata display. Handles loading states, errors, and manual refresh.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Dialog for creating a new chat room with name and topic fields, using a mutation to submit and handling validation and toast feedback.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard showing welcome info, date display, chat rooms, private threads, and dialogs for creating rooms or private chats. Updates date automatically and handles navigation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying © notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Header with navigation buttons, user info, admin‑only items, logout button, and a mobile menu sheet. Handles switching views based on user actions.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Computes weekly mood averages for the current month and renders them as a bar chart with hover details. Falls back to a message when no data exists.",
  "frontend/src/components/MoodCalendar.tsx": "Renders a mood calendar with month and week views, highlighting days with mood entries and allowing date selection. Computes calendar intervals and displays mood-based colors and emojis.",
  "frontend/src/components/MoodEditor.tsx": "Provides a form to edit or create a mood entry for a specific date, handling mood selection, notes, and submission. Integrates update logic and readiness checks for actor availability.",
  "frontend/src/components/MoodHistory.tsx": "Displays mood history with tabs for calendar and trend charts, enabling date selection and mood editing. Handles loading, error states, and retrieval of mood entries.",
  "frontend/src/components/MoodTracker.tsx": "Allows users to log a new mood with optional wellness data like steps and sleep, using a date picker and mood options. Submits entries through save hooks with validation and readiness checks.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Computes monthly average mood scores from mood history and displays them as a bar chart. Groups entries by month and calculates average mood trends.",
  "frontend/src/components/PresentationViewer.tsx": "Shows a slideshow of static presentation images with navigation and supports downloading a generated PDF. Manages slide state and PDF fetch/download handling.",
  "frontend/src/components/PrivateChat.tsx": "Renders a private messaging UI, fetching and displaying messages, handling sends, scrolling, and showing participant info.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Modal dialog for creating a private chat thread by entering another user's principal and triggering thread creation.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Aggregates weekly mood analytics, computing averages, cluster distribution, and trends, and displays insights.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Computes and displays the current week's average mood score, label, and insight based on mood history.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Builds a week-long mood trendline with per‑day averages and visual bars plus an optional polyline chart.",
  "frontend/src/hooks/useActivityLogging.ts": "Provides helper functions to log navigation, interaction, and login events using the activity logging mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useGuestAuth.ts": "Manages guest authentication by storing sessions in localStorage, migrating old sessions, and providing login and clear functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading stored identities and handling login states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors, handling chat rooms, mutations, errors, and various data fetches.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks user session duration and periodically reports it to the backend, including on page unload.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark mode color variables using OKLCH values.",
  "frontend/src/lib/ai/constraints.ts": "Defines response safety constraints and helper functions to validate reflective language, permission asking, and restricted terms.",
  "frontend/src/lib/ai/generator.ts": "Generates AI responses by selecting stages, applying templates, enforcing constraints, and updating session context.",
  "frontend/src/lib/ai/routing.ts": "Implements message-based stage selection for a psychological chat flow and updates session context with detected themes and user intents.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages session-scoped AI chat context using sessionStorage, providing load, save, clear, and summary utilities.",
  "frontend/src/lib/ai/templates.ts": "Defines stage-specific response templates and follow-up questions for the AI’s psychological conversation stages.",
  "frontend/src/lib/ai/templateUtils.ts": "Selects and adapts response templates based on session context, adding optional follow-up questions and light personalization.",
  "frontend/src/lib/ai/types.ts": "Declares enums and interfaces for conversation stages, session context, and response constraints used throughout the AI chat system.",
  "frontend/src/lib/moodErrors.ts": "Classifies mood-related errors into permission, availability, or unexpected types and logs detailed debug information.",
  "frontend/src/lib/timestampUtils.ts": "Provides timestamp conversion utilities between local dates and IC nanosecond timestamps, ensuring accuracy via BigInt.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Generates mood-related weekly summaries, insight text, and labels based on average scores and entry counts.",
  "frontend/src/lib/weekUtils.ts": "Calculates week boundaries and daily utilities such as week ranges, day indices, and formatted day names.",
  "frontend/src/main.tsx": "Bootstraps the React application with query client and Internet Identity provider before rendering the main App.",
  "frontend/src/types/backend-extended.ts": "Defines extended backend-related TypeScript types for moods, analytics, user data, market metadata, and helper functions for handling mood objects.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, animations, typography, and extended theme settings for the project's UI.",
  "project_state.json": "Describes the project’s current state, including active issues and feature requests focused on fixing and redesigning the Mood History functionality."
}