{
  "backend/main.mo": "Defines actor data types for moods, chat, user profiles, analytics, revenue, and market metadata with comparison utilities but no operational logic shown.",
  "feature_evidence.json": "Feature evidence report describing an admin-bootstrap frontend flow and listing affected files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, hooks, utilities, and configuration.",
  "frontend/index.css": "Tailwind CSS base definitions with OKLCH color variables for light/dark themes and global styling rules.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, admin bootstrap, routing, session tracking, and navigation across all major views.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Loads and displays detailed analytics for a specific user with tabs, stats, error handling, and navigation back to the admin dashboard.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Renders a user's mood history using calendar and chart views, with date selection and mood entry lookups.",
  "frontend/src/components/AIChat.tsx": "AI chat interface managing session-scoped messages, session context, typing simulation, and user–AI message exchange using a generator API.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Shows aggregated analytics and user records for admins, with loading/error states and user drilldown navigation.",
  "frontend/src/components/AnonymousLogin.tsx": "Handles both Internet Identity and guest login flows with profile setup, error handling, and activity logging.",
  "frontend/src/components/AppMarketSettings.tsx": "Provides UI for viewing and editing app marketplace metadata and pricing configuration with save actions and loading states.",
  "frontend/src/components/ChatRoom.tsx": "Displays a chat room interface with message fetching, auto-scroll, and sending messages via mutations.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Provides a dialog to create a new chat room with name and topic inputs and submission via mutation.",
  "frontend/src/components/Dashboard.tsx": "Renders the main dashboard showing chat rooms, private threads, date info, and dialogs for creating rooms or private chats.",
  "frontend/src/components/Footer.tsx": "Shows a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with user info, menu items, admin options, and logout controls.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Computes and displays weekly average mood scores for the current month in a bar chart format.",
  "frontend/src/components/MoodCalendar.tsx": "Renders a month or week calendar view of mood entries with clickable mood-colored day cells. Handles navigation between months and highlights selected and current days.",
  "frontend/src/components/MoodEditor.tsx": "Provides a form to create or edit a mood entry for a specific date, loading existing data and submitting updates. Manages mood selection, notes, and actor readiness state.",
  "frontend/src/components/MoodHistory.tsx": "Displays the user's mood history with charts, a calendar, and error handling, allowing selection of a date to edit its entry. Switches to MoodEditor when a date is chosen.",
  "frontend/src/components/MoodTracker.tsx": "Allows users to log a new mood with optional notes and saves it through a mutation. Includes actor readiness checks and error handling.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Computes monthly average mood scores from history and displays them as a bar chart. Shows fallback text when no data is available.",
  "frontend/src/components/PresentationViewer.tsx": "Displays a sequence of presentation slides with navigation controls and thumbnails. Supports moving between slides and downloading the presentation.",
  "frontend/src/components/PrivateChat.tsx": "Renders a private messaging UI that loads messages, auto-scrolls, and sends new messages using query hooks and Internet Identity.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Provides a dialog for creating a new private chat thread by entering another user's principal and triggering a create-thread mutation.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Displays weekly mood insights with summaries, clusters, anomalies, and loading/error states using data from a query hook.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Computes and shows the current week's average mood score, label, and insight based on mood entries.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Generates a weekly mood trendline chart with daily averages, emojis, and a linear regression indicator.",
  "frontend/src/hooks/guestAuthStore.ts": "Implements a shared guest-session store with localStorage persistence, migration, and pub‑sub updates.",
  "frontend/src/hooks/useActivityLogging.ts": "Provides hooks to log user or guest activity events to the backend, including login, navigation, and interactions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Handles post-login admin setup by checking admin status and attempting to claim admin rights once per session.",
  "frontend/src/hooks/useGuestAuth.ts": "Provides guest authentication state and helpers for logging in, tracking, and clearing guest sessions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook to manage login, logout, identity loading, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching and mutating mood data, user profiles, messages, analytics, and related records.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks user session duration and periodically or on unload reports it to the backend when supported.",
  "frontend/src/index.css": "Defines Tailwind layers and OKLCH-based light and dark theme color variables for global styling.",
  "frontend/src/lib/ai/constraints.ts": "Defines AI response safety constraints and utilities to validate responses for diagnosis, therapy claims, reflection, and permission checks.",
  "frontend/src/lib/ai/generator.ts": "Generates AI chat responses by selecting stages, applying templates, enforcing constraints, and updating session context.",
  "frontend/src/lib/ai/routing.ts": "Determines conversation stage based on keywords and context, handles crisis detection, and updates session state.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages chat session context with sessionStorage, including initialization, saving, clearing, and summarizing state.",
  "frontend/src/lib/ai/templates.ts": "Defines stage-specific response templates and follow‑up questions for the conversation system.",
  "frontend/src/lib/ai/templateUtils.ts": "Selects and adapts response templates, extracts key phrases, and combines responses with optional follow-up questions.",
  "frontend/src/lib/ai/types.ts": "Contains enums and interfaces for conversation stages, session context, response constraints, and stage responses.",
  "frontend/src/lib/linearRegression.ts": "Implements simple least‑squares linear regression and returns slope, intercept, and a predict function.",
  "frontend/src/lib/moodErrors.ts": "Classifies errors into availability, permission, or unknown categories based on message content.",
  "frontend/src/lib/timestampUtils.ts": "Provides utilities for converting between local dates and IC nanosecond timestamps, plus helpers for date formatting.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging class names using clsx and tailwind‑merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Generates weekly mood summaries, labels, and insight text with non‑judgmental wording.",
  "frontend/src/lib/weekUtils.ts": "Provides week‑based date utilities, including week boundaries, day indexing, and weekday formatting.",
  "frontend/src/main.tsx": "Entry point that renders the app with React Query and Internet Identity providers.",
  "frontend/src/types/backend-extended.ts": "Defines extended TypeScript interfaces for backend-aligned data models including mood logs, user records, analytics, and marketplace metadata.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and sessionStorage parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, custom colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to restoring admin access via Internet Identity after redeploys."
}