{
  "backend/main.mo": "Main Motoko actor defining all data types (Mood, MoodEntry, ChatRoom, PrivateThread, UserProfile, analytics, market metadata, AI messages, etc.) and implementing core backend functionality for mood tracking, chat, user management, analytics, and app marketplace features.",
  "feature_evidence.json": "Feature evidence report documenting implemented color scheme changes (white background, light pink primary accent, purple secondary accent) with file mappings, component dependencies, and test IDs for each feature.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and utilities, describing UI styling (light pink/purple theme), authentication flows, mood tracking, chat features, hooks for backend queries, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with CSS custom properties defining light/dark theme color variables for background, foreground, primary, secondary, borders, and chart colors using oklch color space.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Anonymous Emotional Support Chat Application', root div, and module script loading main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual testing checklist covering guest/Internet Identity login flows, navigation between pages, startup timeout/error handling, and debugging tips to verify core functionality works without infinite loading states.",
  "frontend/src/App.tsx": "Root React component managing authentication (Internet Identity and guest), profile setup dialog, page routing (dashboard, mood tracker, history, chat, AI, analytics, etc.), header/footer rendering, activity logging, and session tracking with loading states.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple access denied screen component that displays a shield icon and message when non-admin users attempt to access restricted pages.",
  "frontend/src/components/admin/DailyMoodCountsSection.tsx": "Empty file with no content.",
  "frontend/src/components/admin/UserTrendsSection.tsx": "Empty file with no content.",
  "frontend/src/components/admin/WeeklyAveragesSection.tsx": "Empty file with no content.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Empty file placeholder for admin user drilldown functionality.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Empty file placeholder for admin user mood history drilldown functionality.",
  "frontend/src/components/AIChat.tsx": "AI chat interface component that manages a conversational session with an AI companion, allowing users to send messages and receive AI responses with real-time transcript display.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Admin-only analytics dashboard that displays aggregate statistics including total users, mood entries, and average mood scores with user records listing.",
  "frontend/src/components/AnonymousLogin.tsx": "Login screen component offering two authentication methods: Internet Identity login and guest session creation, with terms agreement checkbox and branded UI.",
  "frontend/src/components/AppMarketSettings.tsx": "Admin-only settings page for configuring app market metadata (title, description, category) and pricing configuration with save functionality.",
  "frontend/src/components/BrandLogo.tsx": "Reusable brand logo component that displays the SafeSpace logo image with optional wordmark in small or large sizes.",
  "frontend/src/components/ChatRoom.tsx": "Chat room interface with room list sidebar and message display area, supporting room selection, joining, message sending, and room creation via dialog.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Dialog component for creating new chat rooms with name and topic fields, using form validation and mutation hooks to persist data.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard displaying quick action cards for mood tracking, chat rooms, private chat, and AI companion, plus a weekly mood summary chart.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright information and a branded link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, desktop navigation pills (visual placeholders), profile icons, logout button, and mobile menu sheet.",
  "frontend/src/components/mindfulai/EmotionBadge.tsx": "Empty file with no content.",
  "frontend/src/components/mindfulai/NudgeToast.tsx": "Empty file with no content.",
  "frontend/src/components/mindfulai/ProgressBar.tsx": "Empty file with no content.",
  "frontend/src/components/mindfulai/QuickPills.tsx": "Empty file with no content.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Empty file, likely intended for displaying monthly mood trend visualizations.",
  "frontend/src/components/MoodCalendar.tsx": "Empty file, likely intended for calendar-based mood entry visualization.",
  "frontend/src/components/MoodEditor.tsx": "Empty file, likely intended for editing existing mood entries.",
  "frontend/src/components/MoodHistory.tsx": "Displays a list of past mood entries with scores, timestamps, and optional notes, fetched via query hook.",
  "frontend/src/components/MoodTracker.tsx": "Mood entry form with 13 predefined mood options (emoji buttons), optional notes textarea, and submission logic using mutation hook.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Empty file, likely intended for displaying overall mood trend analytics.",
  "frontend/src/components/PresentationViewer.tsx": "Admin-only component that displays and allows downloading a PDF presentation file using an iframe viewer.",
  "frontend/src/components/PrivateChat.tsx": "React component for private messaging that displays a list of chat threads and allows users to send/receive messages in a selected thread. Includes functionality to start new chats via a dialog and handles real-time message updates.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Dialog component for initiating a new private chat by entering another user's principal ID. Validates the principal format and triggers the thread creation mutation.",
  "frontend/src/components/StartupErrorState.tsx": "Error fallback UI component that displays when the application fails to start, showing error details and a retry button.",
  "frontend/src/components/StartupTimeoutFallback.tsx": "Timeout fallback UI component displayed when application startup exceeds expected duration, offering reload and cache reset options.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Component that displays weekly mood analysis data including mood averages, steps, sleep hours, and trends. Restricts access to authenticated users only.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Empty file with no content.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Empty file with no content.",
  "frontend/src/hooks/guestAuthStore.ts": "Observable store for managing guest session state with localStorage persistence. Provides subscribe/unsubscribe pattern for reactive updates and methods to create/clear guest sessions.",
  "frontend/src/hooks/useActivityLogging.ts": "Custom hook that wraps activity logging mutations to track user actions (login, page navigation, interactions) for both authenticated and guest users.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hook that checks if the authenticated user has admin privileges and logs the authentication status. Used for admin-specific initialization logic.",
  "frontend/src/hooks/useGuestAuth.ts": "React hook that subscribes to the guest auth store and provides methods to create and clear guest sessions, exposing guest ID and authentication status.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including user profiles, mood tracking, chat, AI messages, admin functions, analytics, and guest sessions.",
  "frontend/src/hooks/useSessionTracking.ts": "React hook that tracks guest session duration and logs activity at intervals, reporting session metrics via mutation and beacon API on unload.",
  "frontend/src/index.css": "Tailwind CSS configuration with SafeSpace light pink/purple theme, glassmorphism effects, aurora background animations, and custom navigation/header styling.",
  "frontend/src/lib/adminMoodAnalytics.ts": "Utility functions for admin mood analytics including emoji/color mapping, daily mood counts computation, and weekly average calculations from user records.",
  "frontend/src/lib/ai/constraints.ts": "Validates AI responses to ensure they don't contain medical diagnoses or therapy cure claims.",
  "frontend/src/lib/ai/generator.ts": "Empty file, likely placeholder for AI response generation logic.",
  "frontend/src/lib/ai/routing.ts": "Routes user messages to appropriate conversation stages (crisis, intake, psychoeducation, goals, coping, reflective) based on content and exchange count.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages AI session context in sessionStorage, providing init, load, save, and clear functions for conversation state persistence.",
  "frontend/src/lib/ai/templates.ts": "Defines response templates for each conversation stage (intake, reflective, crisis, etc.) and provides random template selection.",
  "frontend/src/lib/ai/templateUtils.ts": "Adapts AI response templates by replacing placeholders with detected emotions and generic terms from user messages.",
  "frontend/src/lib/ai/types.ts": "TypeScript types for AI conversation stages and session context including stage, themes, exchange count, and timestamp.",
  "frontend/src/lib/appStorage.ts": "Utility to clear SafeSpace-specific localStorage and sessionStorage keys without affecting other apps' data.",
  "frontend/src/lib/avatar.ts": "Generates user initials from name strings for avatar display, handling single and multi-word names.",
  "frontend/src/lib/linearRegression.ts": "Implements simple linear regression calculation for trend analysis, returning slope, intercept, and prediction function.",
  "frontend/src/lib/mindfulai/emotionDetection.ts": "Detects emotions in text using keyword matching, returning emotion type and confidence score or null if no match.",
  "frontend/src/lib/mindfulai/engagement.ts": "Calculates user engagement score (0-100) based on exchange count, capping at 20 exchanges for 100% engagement.",
  "frontend/src/lib/mindfulai/nudges.ts": "Provides supportive nudge messages and logic to determine when to show them based on time interval (5 min) and exchange count (>3).",
  "frontend/src/lib/mindfulai/quickPills.ts": "Exports default quick-response pill options for users to quickly express common emotional states or needs.",
  "frontend/src/lib/mindfulai/sessionUX.ts": "Manages MindfulAI session state (emotion, engagement, nudge timing) with sessionStorage persistence functions for init, load, save, and clear.",
  "frontend/src/lib/mindfulai/types.ts": "Defines TypeScript interfaces for emotion data (emotion string and confidence) and MindfulAI state tracking.",
  "frontend/src/lib/moodErrors.ts": "Defines mood error types (availability, permission, unknown) and classifies errors based on message content.",
  "frontend/src/lib/timestampUtils.ts": "Provides utilities to convert between nanosecond timestamps (bigint) and JavaScript Date objects, plus formatting functions.",
  "frontend/src/lib/utils.ts": "Exports a utility function `cn` that merges Tailwind CSS classes using clsx and tailwind-merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Generates mood labels and weekly insights based on average mood scores, providing contextual feedback messages.",
  "frontend/src/lib/weekUtils.ts": "Provides utilities for week-based date calculations: getting current week start/end (Monday-based), generating week days array, and checking if a date is in current week.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/types/backend-extended.ts": "Re-exports backend types and adds frontend-specific interfaces for ChatRoom and PrivateThread structures.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with light pink, purple, lavender, and other brand colors using OKLCH color space, plus extended theme tokens.",
  "project_state.json": "Project state tracking document showing SafeSpace app with light pink/purple color scheme on white background, listing completed color theme update features."
}