{
  "backend/main.mo": "Defines actor types for moods, chat, analytics, user data, market data, storage, and utility modules used across the backend.",
  "feature_evidence.json": "Lists feature evidence entries linking frontend files and components to required backend integration and React Query hook work.",
  "frontend-file-summaries.txt": "Provides short summaries of each major frontend file and component, describing their roles and current placeholder behavior.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH-driven theme variables for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Outlines steps for verifying app startup, login flows, navigation, and fallback behaviors in smoke testing.",
  "frontend/src/App.tsx": "Main React application handling authentication, startup states, routing between pages, and profile setup.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with an admin restriction notice and a back button.",
  "frontend/src/components/admin/DailyMoodCountsSection.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/UserTrendsSection.tsx": "Empty placeholder file.",
  "frontend/src/components/admin/WeeklyAveragesSection.tsx": "Empty placeholder file.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Empty placeholder component file.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Empty placeholder component file.",
  "frontend/src/components/AIChat.tsx": "Placeholder AI companion UI with a back button and a message indicating backend dependency.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Shows an analytics dashboard placeholder, restricting access to admins and offering a back button.",
  "frontend/src/components/AnonymousLogin.tsx": "Provides guest login creation, logs the event, and offers Internet Identity login as an alternative.",
  "frontend/src/components/AppMarketSettings.tsx": "Admin-only placeholder screen for app market settings with a back button.",
  "frontend/src/components/ChatRoom.tsx": "Displays a placeholder group chat room view with a back button.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard showing navigation cards and weekly mood summary, loading data from hooks.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding and a caffeine.ai referral link.",
  "frontend/src/components/Header.tsx": "Top navigation header with dynamic links, authentication controls, and admin menu options.",
  "frontend/src/components/mindfulai/EmotionBadge.tsx": "Empty placeholder file.",
  "frontend/src/components/mindfulai/NudgeToast.tsx": "Empty placeholder file.",
  "frontend/src/components/mindfulai/ProgressBar.tsx": "Empty placeholder file.",
  "frontend/src/components/mindfulai/QuickPills.tsx": "Empty placeholder file.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Empty placeholder component file.",
  "frontend/src/components/MoodCalendar.tsx": "Empty placeholder component file.",
  "frontend/src/components/MoodEditor.tsx": "Empty placeholder component file.",
  "frontend/src/components/MoodHistory.tsx": "Loads and displays a list of past mood entries with timestamps and optional notes.",
  "frontend/src/components/MoodTracker.tsx": "Allows users to record their current mood with notes and submit the entry to the backend.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Empty placeholder component file.",
  "frontend/src/components/PresentationViewer.tsx": "Admin-only placeholder screen for viewing presentations with a back button.",
  "frontend/src/components/PrivateChat.tsx": "Displays a placeholder private chat interface with a back button.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/StartupErrorState.tsx": "Displays a startup error message with details and a retry button.",
  "frontend/src/components/StartupTimeoutFallback.tsx": "Shows a timeout fallback UI with reload and reset options.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Placeholder component showing weekly mood insights with a back button.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Empty placeholder file.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Empty placeholder file.",
  "frontend/src/hooks/guestAuthStore.ts": "Manages guest sessions with localStorage persistence and subscription updates.",
  "frontend/src/hooks/useActivityLogging.ts": "Provides functions to log login, navigation, and interaction events via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Checks admin status and logs when an authenticated user is not an admin.",
  "frontend/src/hooks/useGuestAuth.ts": "React hook for accessing and managing guest sessions through guestAuthStore.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication, context, and state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for admin checks, profiles, mood data, and activity logging; many are placeholders.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks session duration and periodically logs activity, including on unload.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH-based color variables for light and dark themes, plus global base styles.",
  "frontend/src/lib/adminMoodAnalytics.ts": "Provides utilities for mapping moods to emojis/colors and computing daily mood counts and weekly averages.",
  "frontend/src/lib/ai/constraints.ts": "Validates AI responses by blocking diagnostic or therapeutic claims.",
  "frontend/src/lib/ai/generator.ts": "Empty placeholder file for AI response generation.",
  "frontend/src/lib/ai/routing.ts": "Selects conversation stage based on message content and session context.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages session context storage, initialization, loading, saving, and clearing.",
  "frontend/src/lib/ai/templates.ts": "Defines response templates per conversation stage and a helper to select one.",
  "frontend/src/lib/ai/templateUtils.ts": "Adapts template text by replacing placeholders and detecting simple emotions.",
  "frontend/src/lib/ai/types.ts": "Contains conversation stage type definitions and the SessionContext interface.",
  "frontend/src/lib/appStorage.ts": "Clears SafeSpace-specific localStorage and sessionStorage keys.",
  "frontend/src/lib/linearRegression.ts": "Implements basic linear regression and prediction on point data.",
  "frontend/src/lib/mindfulai/emotionDetection.ts": "Detects basic emotions from text using keyword matching.",
  "frontend/src/lib/mindfulai/engagement.ts": "Computes a simple engagement score based on exchange count.",
  "frontend/src/lib/mindfulai/nudges.ts": "Provides supportive nudge messages and logic for when to show them.",
  "frontend/src/lib/mindfulai/quickPills.ts": "Exports preset quick-start message suggestions.",
  "frontend/src/lib/mindfulai/sessionUX.ts": "Manages MindfulAI UI state in session storage with load/save helpers.",
  "frontend/src/lib/mindfulai/types.ts": "Defines emotion data and MindfulAIState interfaces.",
  "frontend/src/lib/moodErrors.ts": "Classifies errors into mood-related categories based on message content.",
  "frontend/src/lib/timestampUtils.ts": "Utilities for converting, formatting, and handling bigint nanosecond timestamps.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Generates mood labels and insight text based on average mood scores.",
  "frontend/src/lib/weekUtils.ts": "Helpers for computing the current week range, listing week days, and checking week membership.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider.",
  "frontend/src/types/backend-extended.ts": "Defines extended backend data types including moods, mood entries, user records, chat structures, and analytics models.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and remove them from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, and plugins for typography and UI transitions.",
  "project_state.json": "Describes the project's restoration goals, known issues, and feature requirements for rebuilding the SafeSpace backend."
}