{
  "backend/main.mo": "Defines data types for moods, chat, analytics, user profiles, and market metadata, including comparison helpers and storage-related structures.",
  "feature_evidence.json": "Report linking feature changes to impacted frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS base definitions and OKLCH color variables for light and dark themes with global styling rules.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app handling routing, authentication (guest and II), profile setup, session tracking, and view selection.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Displays detailed admin view of a user, including identity, mood entry stats, loading/error states, and tabs for mood history.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Shows a user's mood history with calendar and chart views, including date selection and multiple trend visualizations.",
  "frontend/src/components/AIChat.tsx": "AI chat component managing session-scoped messages, session context, greeting initialization, and streamed AI responses.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Admin dashboard that loads analytics and user data, handles admin checks, and provides navigation to per‑user drilldowns.",
  "frontend/src/components/AnonymousLogin.tsx": "Manages Internet Identity and guest login flows, including profile setup, validation, and login state handling.",
  "frontend/src/components/AppMarketSettings.tsx": "Admin UI for editing app metadata and pricing settings with loading states and save handlers.",
  "frontend/src/components/ChatRoom.tsx": "Renders a chat room UI with message fetching, auto-scroll, room info display, and message sending logic. Includes loading skeletons, refresh, and error handling.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Provides a dialog to create new chat rooms with name/topic inputs and mutation handling. Generates unique room IDs and shows success/error toasts.",
  "frontend/src/components/Dashboard.tsx": "Displays the main dashboard with date display, navigation to rooms and private chats, and dialogs for creating rooms. Loads chat rooms and private threads while managing daily date updates.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing logo, user info, and navigation buttons including admin-only items. Supports desktop and mobile layouts with a collapsible menu.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Computes weekly mood averages for the current month and renders them as a bar-style trend chart. Handles empty mood data with a fallback message.",
  "frontend/src/components/MoodCalendar.tsx": "Displays a month or week calendar with mood entries, allowing users to select days with recorded moods.",
  "frontend/src/components/MoodEditor.tsx": "Provides a UI to edit or update a mood entry for a specific date, including mood selection and notes.",
  "frontend/src/components/MoodHistory.tsx": "Shows the user’s mood history with charts and a calendar, enabling editing of existing entries.",
  "frontend/src/components/MoodTracker.tsx": "Allows users to log a new mood entry with optional wellness data and select the date for the entry.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Calculates and displays monthly average mood scores in a bar chart to show long-term trends.",
  "frontend/src/components/PresentationViewer.tsx": "Lets users view and navigate through a sequence of presentation slides with thumbnail previews.",
  "frontend/src/components/PrivateChat.tsx": "Renders a private chat UI, fetching messages, handling sending, auto‑scrolling, and showing thread participant info.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Dialog for starting a new private thread by entering another user's principal and creating a unique thread ID.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Displays weekly mood insights including summaries, clusters, and anomalies with loading and error states.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Computes and displays the current week's average mood, label, and insight text based on mood entries.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Generates per‑day mood averages, emojis, and an SVG regression trendline for the current week's mood data.",
  "frontend/src/hooks/guestAuthStore.ts": "Implements a singleton guest session store with localStorage persistence, migration, and pub‑sub updates.",
  "frontend/src/hooks/useActivityLogging.ts": "Provides hooks to log user or guest activity events through the backend, including login and navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useGuestAuth.ts": "Handles guest login state, syncing with a guestAuthStore and exposing login and logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing AuthClient creation, login flow, stored identity restoration, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for chat, messaging, and other backend operations with error handling and toast notifications.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks user session duration and reports it periodically or on page unload to the backend.",
  "frontend/src/index.css": "Defines global Tailwind layers and extensive OKLCH-based light/dark theme color variables.",
  "frontend/src/lib/ai/constraints.ts": "Defines AI safety constraints and helper validators for detecting unsafe content, reflective language, and permission prompts.",
  "frontend/src/lib/ai/generator.ts": "Generates AI responses using stage-based templates, applies constraints, adds crisis messaging, and updates conversation context.",
  "frontend/src/lib/ai/routing.ts": "Implements keyword-based logic to select conversation stages and update session context, including crisis detection and theme extraction.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages session-scoped chat context with load/save/clear helpers and provides a simple session summary string.",
  "frontend/src/lib/ai/templates.ts": "Defines response templates for each conversation stage, including main messages and optional follow‑up questions.",
  "frontend/src/lib/ai/templateUtils.ts": "Chooses and adapts response templates based on session context, adding optional follow‑ups and minor personalization.",
  "frontend/src/lib/ai/types.ts": "Declares conversation stage enums and interfaces for session context, response constraints, and stage responses.",
  "frontend/src/lib/linearRegression.ts": "Provides a least‑squares linear regression utility returning slope, intercept, and a predict function.",
  "frontend/src/lib/moodErrors.ts": "Classifies mood‑related errors into permission, availability, or unexpected types and logs detailed debug info.",
  "frontend/src/lib/timestampUtils.ts": "Provides conversions between local dates and IC nanosecond timestamps with BigInt‑safe math and date utilities.",
  "frontend/src/lib/utils.ts": "Exports a utility for merging class names using clsx and tailwind‑merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Generates weekly mood summary labels, insights, and empty‑state messages based on average scores and entry counts.",
  "frontend/src/lib/weekUtils.ts": "Implements Monday‑Sunday week calculations, including week boundaries, day indexing, and weekday formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity before rendering the root component.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend TypeScript interfaces mirroring backend structures for mood data, user profiles, analytics, messages, and marketplace metadata.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, border radii, and enabling plugins for animations and typography.",
  "project_state.json": "Tracks project state, issues, and feature requirements, including a regression affecting the guest login flow and session propagation."
}