{
  "backend/main.mo": "Defines the actor’s data types for moods, chat, analytics, market metadata, and storage, including comparison helpers and domain models.",
  "backend/migration.mo": "Migration module that transforms old actor state to a new empty state.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected frontend files, components, and test references for recent changes.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of numerous frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS variable definitions and theme styles for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the frontend root and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile loading, navigation, session tracking, and rendering routed views.",
  "frontend/src/components/AdminUserDrilldown.tsx": "Fetches and displays detailed analytics for a specific user, including metadata, mood stats, and tabbed views such as mood history. Handles loading, error states, and navigation back to the main dashboard.",
  "frontend/src/components/AdminUserDrilldownMoodHistory.tsx": "Shows a user’s mood entries in calendar and chart formats with selectable views and detailed daily entries. Provides alerts when no mood data is available.",
  "frontend/src/components/AIChat.tsx": "AI chat interface handling message history, session context, and AI response generation with sessionStorage persistence.",
  "frontend/src/components/AnalyticsDashboard.tsx": "Admin dashboard showing aggregated analytics, user lists, and drilldown navigation into individual user data. Handles admin checks, loading states, errors, and data refresh.",
  "frontend/src/components/AnonymousLogin.tsx": "Handles guest and Internet Identity login flows, including profile setup, error handling, and login activity logging. Manages multi‑step authentication UI and submits user profile data.",
  "frontend/src/components/AppMarketSettings.tsx": "Provides UI for viewing and updating app marketplace metadata and pricing settings. Loads existing config, allows edits, and saves changes via mutation hooks.",
  "frontend/src/components/ChatRoom.tsx": "Displays chat messages for a room, handles sending messages, auto‑scrolling, and message refreshing.",
  "frontend/src/components/CreateChatRoomDialog.tsx": "Dialog for creating a new chat room with name and topic selection, submitting via mutation.",
  "frontend/src/components/Dashboard.tsx": "Main dashboard showing app intro, date display, chat room lists, and dialogs for creating or starting chats.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with user info, logout, and adaptive nav items including admin options.",
  "frontend/src/components/MonthlyMoodTrendChart.tsx": "Generates weekly mood averages for the current month and displays them as a bar chart.",
  "frontend/src/components/MoodCalendar.tsx": "Renders a month or week calendar of mood entries with emoji and color indicators and allows selecting days with logged moods.",
  "frontend/src/components/MoodEditor.tsx": "Provides a form to create or edit a mood entry for a specific date, loading existing data and saving updates through mutations.",
  "frontend/src/components/MoodHistory.tsx": "Displays mood history with charts and a calendar, handles errors, and opens the mood editor when a date is selected.",
  "frontend/src/components/MoodTracker.tsx": "Allows users to log their current mood with notes and saves entries using backend mutations with permission and error handling.",
  "frontend/src/components/OverallMoodTrendChart.tsx": "Generates monthly average mood scores and renders them as a bar chart to show long-term trends.",
  "frontend/src/components/PresentationViewer.tsx": "Displays a slide-based presentation with navigation controls and thumbnail previews.",
  "frontend/src/components/PrivateChat.tsx": "Renders a private chat UI that fetches, displays, and sends messages within a thread, including auto-scrolling and error handling.",
  "frontend/src/components/StartPrivateChatDialog.tsx": "Dialog for creating a new private chat thread by entering another user's principal and invoking the create-thread mutation.",
  "frontend/src/components/WeeklyMoodInsights.tsx": "Displays weekly mood insights including summaries, clusters, and anomalies with loading and error states.",
  "frontend/src/components/WeeklyMoodSummary.tsx": "Computes and displays the current week's average mood score, label, and insight based on mood history.",
  "frontend/src/components/WeeklyMoodTrendline.tsx": "Generates a weekly mood trendline chart with daily averages, emojis, and a linear regression line.",
  "frontend/src/hooks/guestAuthStore.ts": "Manages guest session state with localStorage persistence and pub‑sub updates, including session migration and UUID generation.",
  "frontend/src/hooks/useActivityLogging.ts": "Provides hooks to log user or guest activity events via actor calls, including login, navigation, and interaction logs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity state and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useGuestAuth.ts": "Provides guest session state, subscription to guestAuthStore, and functions for guest login and logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing auth client creation, login, logout, and reactive identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on moods, profiles, messages, analytics, and other backend calls using the actor.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks user session duration and reports it periodically or on unload via backend or sendBeacon.",
  "frontend/src/index.css": "Configures Tailwind and defines extensive OKLCH-based color variables for light and dark themes.",
  "frontend/src/lib/ai/constraints.ts": "Defines response safety constraints and validation helpers for diagnosis checks, therapy claims, reflective language, and permission phrases.",
  "frontend/src/lib/ai/generator.ts": "Generates AI responses by selecting stages and templates, applying constraints, adding crisis messaging, validating output, and updating session context.",
  "frontend/src/lib/ai/routing.ts": "Implements conversation stage selection based on message content and context, including crisis detection logic. Also updates session context with themes, goals, and technique requests.",
  "frontend/src/lib/ai/sessionContext.ts": "Manages session context storage in sessionStorage and provides helpers to load, save, clear, and summarize context.",
  "frontend/src/lib/ai/templates.ts": "Defines stage-specific response templates and follow-up questions for all conversation stages.",
  "frontend/src/lib/ai/templateUtils.ts": "Selects and adapts response templates based on session context, optionally adding follow-up questions and mirroring user language.",
  "frontend/src/lib/ai/types.ts": "Declares types for conversation stages, session context, constraints, and structured stage responses.",
  "frontend/src/lib/linearRegression.ts": "Provides a simple least-squares linear regression utility returning slope, intercept, and a predict function.",
  "frontend/src/lib/moodErrors.ts": "Classifies errors into availability, permission, or unknown categories by inspecting error text.",
  "frontend/src/lib/timestampUtils.ts": "Converts between Date objects and nanosecond timestamps, and provides helpers for formatting and normalizing dates.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/lib/weeklySummaryText.ts": "Maps weekly mood averages to descriptive labels and generates simple insights and empty-state messages.",
  "frontend/src/lib/weekUtils.ts": "Generates week-based date calculations such as week start/end, day lists, index lookup, and formatting.",
  "frontend/src/main.tsx": "Initializes the React app with query client and Internet Identity provider, then renders the root component.",
  "frontend/src/types/backend-extended.ts": "Defines extended frontend-facing types mirroring backend models for moods, users, analytics, and summaries.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, border radii, and animations, and enabling plugins.",
  "project_state.json": "Describes project rollback requirements, existing features, and pending requests for restoring version 99 behavior."
}