{
  "kind": "build_request",
  "title": "Fix guest name screen regression so guest can enter the app",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the guest login flow so that after submitting the guest name form (screen title: \"Welcome, Guest\"), the app reliably transitions into the authenticated app experience (dashboard) instead of returning to the main login page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I am not able to enter the app after guest name screen",
          "It brings back to main login page....",
          "Welcome, Guest"
        ]
      },
      "acceptanceCriteria": [
        "From the main login page, clicking \"Continue as guest\" shows the full-page guest name entry step.",
        "Submitting the guest name form with a non-empty name results in the login UI disappearing and the dashboard rendering.",
        "After successful guest submit, the login page does not re-appear due to any auth-state effect/rerender.",
        "Refreshing the browser after guest login keeps the user in the app (guest session persists)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update guest session state propagation so all components using the guest auth hook observe guest session changes immediately after guest login and logout (even when different components call the hook independently).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I am not able to enter the app after guest name screen",
          "It brings back to main login page...."
        ]
      },
      "acceptanceCriteria": [
        "When the guest session is created in the guest name screen, the App-level guest auth state (used to decide whether to show the login screen) updates in the same tick/interaction without requiring a full page reload.",
        "When the guest session is cleared (guest logout), the App-level guest auth state updates immediately and the login screen is shown.",
        "Guest session migration behavior (adding missing guestId to old sessions) continues to work."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT.",
    "Backend must remain single-actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Changing Internet Identity login behavior beyond ensuring it does not interfere with guest login.",
    "Adding new backend endpoints or altering backend persistence/state schema.",
    "Introducing routing libraries or switching to a different navigation architecture."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}