{
  "kind": "build_request",
  "title": "Bootstrap current Internet Identity principal as admin to restore admin dashboard access",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend method that allows the currently logged-in Internet Identity caller to become an admin, so the admin dashboard can be accessed after a redeploy resets the admin allowlist.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Do you want me to make your current Internet Identity the admin?",
          "yes",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a shared update call (e.g., `claimAdminForCaller`/`bootstrapAdmin`) that adds `caller` to the admin allowlist used by `isCallerAdmin()`.",
        "The method is safe against arbitrary takeover: it succeeds only when there are zero admins configured (or when `caller` is already an admin), and otherwise returns an error/traps with a clear message.",
        "After calling the method successfully, subsequent calls to `isCallerAdmin()` for the same principal return `true`."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a frontend bootstrap flow that, after a successful Internet Identity login, attempts to set the current principal as admin (only when needed) and then refreshes admin-gated UI state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i am not able to login in admin dashboard",
          "yes",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "A new React Query mutation hook exists to call the new backend admin-claim method.",
        "On successful Internet Identity login, the app triggers the admin-claim mutation if `useIsCallerAdmin()` is `false` (or unknown) and then invalidates/refetches the `['isCallerAdmin']` query so the Header and admin views update without a manual refresh.",
        "If the claim fails because an admin already exists, show an English, user-friendly message explaining that this Internet Identity is not an admin and an existing admin must grant access.",
        "No changes are made to any frontend files listed as immutable in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Do not edit any paths listed in frontend.immutablePaths (compose around them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing third-party authentication providers (only Internet Identity is supported).",
    "Adding a full admin management UI (e.g., listing admins, removing admins) beyond bootstrapping the current caller as admin.",
    "Fixing general Internet Identity login issues unrelated to admin authorization (e.g., device clock sync), unless directly required for the bootstrap flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}