{
  "kind": "build_request",
  "title": "Roll back frontend and backend to version 99 behavior",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Revert the deployed application behavior to match version 99 across both frontend and backend, undoing the changes introduced in version 100.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-12"
        ],
        "quotes": [
          "rollback to version 99",
          "both",
          "proceed"
        ]
      },
      "acceptanceCriteria": [
        "The app builds successfully (frontend + backend) after the rollback changes are applied.",
        "User-visible behavior matches version 99 rather than version 100 for the main flows (login, navigation, dashboard, and admin access gating).",
        "No new version-100-only flows remain enabled (e.g., any admin auto-bootstrap/auto-claim logic added in v100 is removed or disabled to match v99)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove or disable the version 100 admin auto-bootstrap flow so that the app no longer automatically attempts to claim admin rights after Internet Identity login (restore version 99 behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "rollback to version 99",
          "proceed"
        ]
      },
      "acceptanceCriteria": [
        "The app no longer invokes an admin bootstrap hook after login (e.g., no automatic claim attempt / no toast tied to bootstrap error).",
        "Admin UI gating is determined only by the existing admin status check, as in version 99."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove or disable the backend method that was added in version 100 to allow the current caller to become an admin (restore version 99 behavior).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-12"
        ],
        "quotes": [
          "rollback to version 99",
          "both",
          "proceed"
        ]
      },
      "acceptanceCriteria": [
        "The backend no longer exposes a caller self-promotion admin method introduced in v100 (e.g., becomeAdmin or equivalent), matching v99 behavior.",
        "Backend authorization for admin-only methods continues to work as it did in v99 (admin-only calls still require admin privileges)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only introduce backend/migration.mo if an upgrade-safe state migration is required.",
    "Do not edit frontend files under frontend/src/components/ui or any path listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Implementing any new features beyond restoring version 99 behavior.",
    "Introducing new authentication providers or third-party auth (only Internet Identity is supported).",
    "Redesigning UI/branding unrelated to the rollback."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}