{
  "kind": "build_request",
  "title": "Implement SafeSpace aurora theme, glass login card, and authenticated-only header (placeholder nav)",
  "projectName": "SafeSpace",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Show the top header navigation bar only for authenticated (Internet Identity) sessions; do not render the header on the unauthenticated login screen or during guest sessions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "1. authenticated page only"
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated and not in guest mode, the app shows the AnonymousLogin screen with no header present.",
        "When in guest mode, the app does not render the Header component anywhere in the layout.",
        "When authenticated, the header is visible at the top of the app and remains sticky."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the authenticated header UI to match the provided SafeSpace spec: a solid white strip across the top; left-aligned SafeSpace circular heart logo and 'SafeSpace' wordmark; centered nav items with 'Home' styled as a purple pill with a heart icon; other nav items shown as black icons + black text ('AI Companion', 'Mood Tracker', 'My History'); right-aligned purple circular profile icon and purple circular alien/robot icon, plus an outlined Logout button with an exit/arrow icon and black text/border.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Top Navigation Bar (Header):\n\nA solid, clean white strip runs across the entire top.\n\nFar Left: A circular logo painted in purple containing a white heart icon, followed by the word \"SAFESPACE\" in purple sans-serif capital letters.\n\nCenter Navigation: Four navigation items.\n\n\"Home\": A purple oval pill-shaped button containing a purple heart icon and the word \"Home\".\n\n\"AI Companion\": A black sparkle/star icon followed by the black text \"AI Companion\".\n\n\"Mood Tracker\": A black smiley-face line icon followed by the black text \"Mood Tracker\".\n\n\"My History\": A black clock/history icon followed by the black text \"My History\".\n\nFar Right:\n\nA purple circular user profile icon (head and shoulders outline).\n\nA second purple circular icon containing a stylized alien/robot head.\n\nA rectangular \"Logout\" button with a black border, containing a black arrow-exit icon and the text \"Logout\"."
        ]
      },
      "acceptanceCriteria": [
        "Header background is solid white with subtle separation (border or shadow) from the aurora background.",
        "Left side shows the SafeSpace logo mark and wordmark consistent with existing BrandLogo assets.",
        "Center nav visually matches: Home appears as a pill with heart icon; other items have black icon + black label text.",
        "Right side shows two purple circular icons (profile and alien/robot) and a Logout button with black border and an exit/arrow icon.",
        "Logout triggers the existing logout/clear behavior and clears React Query cache as it currently does."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Render the header center navigation items as visual placeholders only (non-navigating): clicking them must not change the current page or route; keep existing in-app navigation mechanisms elsewhere (e.g., dashboard cards) unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "2. no ..."
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Home', 'AI Companion', 'Mood Tracker', or 'My History' in the header does not change the currently displayed page/content.",
        "The nav items still have appropriate visual affordances (consistent styling) without implying functional navigation (e.g., no active-route switching behavior).",
        "Existing non-header navigation (e.g., Dashboard actions) continues to work as before."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement the SafeSpace aurora background using CSS gradients/effects (no generated background image): a vibrant deep abstract background with diagonal, aurora-like light streaks in violet, magenta, purple, and electric cyan; include soft blooms/luminous patches and subtle motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Background: A vibrant, deep abstract background featuring sweeping, aurora-like light streaks in gradients of violet, magenta, purple, and electric cyan blue. The light flows diagonally across the screen, creating soft blooms and luminous patches.",
          "3. recreate"
        ]
      },
      "acceptanceCriteria": [
        "The main app background uses CSS (gradients/blur/overlays/animations) and not a static image file.",
        "The palette includes visible electric cyan accents in addition to violet/magenta/purple.",
        "The background reads as diagonally flowing aurora streaks with soft bloom patches, and has subtle animated movement without being distracting."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the unauthenticated login experience matches the described central glassmorphism card layout: centered frosted/translucent white card with a soft outer glow; top logo; heading 'Welcome to SafeSpace' in bold purple; subheading 'Your personal mental wellness companion' in smaller black/gray; primary gradient button 'Login with Internet Identity' with sparkle icon; 'OR' divider; secondary 'Continue as Guest' button with glowing purple outline; and a Terms of Service + Privacy Policy agreement checkbox.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Central Login Card:\n\nContainer: A large, vertically oriented rectangular card centered on the screen with soft, deeply rounded corners. It has a \"glassmorphism\" effect: frosted, translucent white that blurs the colorful background behind it, framed by a brilliant, soft white outer glow that makes it stand out.\n\nContent (Top to Bottom):\n\nLogo: Centered at the top, the same purple circular logo with a white heart as seen in the header.\n\nHeading: The text \"Welcome to SafeSpace\" in large, bold, purple sans-serif font.\n\nSub-heading: The text \"Your personal mental wellness companion\" in smaller black text below the heading.\n\nPrimary Button: A wide, rounded rectangular button with a vibrant horizontal gradient fill fading from purple on the left to bright magenta/pink on the right. Inside is a white sparkle icon and the white text \"Login with Internet Identity\".\n\nDivider: A thin gray horizontal line broken in the center by the word \"OR\" in small gray text.\n\nSecondary Button: A wide, rounded rectangular button with a white fill and a distinct, glowing purple outline/border. Inside is the black text \"Continue as Guest\".\n\nFooter: A checked square checkbox box followed by the small gray text: \"I agree to you agree to ur Terms of Service and Privacy Policy\"."
        ]
      },
      "acceptanceCriteria": [
        "The login card is centered and has a white frosted/glass look with a soft glow that separates it from the aurora background.",
        "Primary button shows a purple-to-magenta gradient and includes a sparkle icon next to the label.",
        "Secondary button is white with a glowing purple outline and black label text.",
        "Internet Identity login remains gated by the terms checkbox (must be checked to enable login).",
        "All user-facing text is in English and uses the corrected phrasing for the terms agreement sentence/links."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add the specified corner accent element to the login screen: a partially visible, translucent purple circular icon with a user silhouette in the bottom-left corner (purely decorative).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Corner Elements:\n\nBottom Left: A translucent purple circular icon with a user shape, partially visible."
        ]
      },
      "acceptanceCriteria": [
        "On the login screen, a decorative bottom-left translucent purple circle is partially off-screen/peeking in and includes a user silhouette icon.",
        "The element does not block interaction with the login card or buttons (pointer-events disabled)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Ensure SafeSpace logo assets are present and used as static frontend assets (no backend serving): use the existing generated image files referenced by the BrandLogo component under frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Far Left: A circular logo painted in purple containing a white heart icon"
        ]
      },
      "acceptanceCriteria": [
        "BrandLogo renders images from /assets/generated/safespace-logo.dim_64x64.png and /assets/generated/safespace-logo.dim_256x256.png.",
        "No backend endpoints are added or used to serve logo images."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Keep the backend (Motoko canister) behavior and schema unchanged; this request is UI/UX only.",
    "Keep existing application pages and functionality intact; only prevent navigation via the header nav placeholders."
  ],
  "nonGoals": [
    "Implementing functional routing for header nav items (they must remain visual placeholders).",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Replacing the CSS-based aurora background with a generated/static image background."
  ],
  "imageRequirements": {
    "required": [
      "SafeSpace logo mark: white heart centered in a purple circle, transparent background (safespace-logo.dim_256x256.png)",
      "SafeSpace logo mark: white heart centered in a purple circle, transparent background (safespace-logo.dim_64x64.png)"
    ],
    "edits": []
  }
}