{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend admin bootstrap flow after Internet Identity login",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "After Internet Identity login, attempt to bootstrap the current principal as admin when needed, refresh admin-gated UI, and show a friendly denial message when an admin already exists.",
      "acceptanceCriteria": [
        "A new React Query mutation hook exists to call the new backend admin-claim method.",
        "On successful Internet Identity login, the app triggers the admin-claim mutation if `useIsCallerAdmin()` is `false` (or unknown) and then invalidates/refetches the `['isCallerAdmin']` query so the Header and admin views update without a manual refresh.",
        "If the claim fails because an admin already exists, show an English, user-friendly message explaining that this Internet Identity is not an admin and an existing admin must grant access.",
        "No changes are made to any frontend files listed as immutable in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., `useClaimAdminForCaller`) that calls the backend admin-claim capability via the actor and provides structured success/error handling for the bootstrap flow. Use the authorization component patterns for authenticated calls and React Query cache invalidation; verify the component's usage instructions before implementing. Before editing, confirm this file is not listed in frontend.immutablePaths in SYSTEM_CONTEXT."
        },
        {
          "path": "frontend/src/hooks/useAdminBootstrap.ts",
          "operation": "create",
          "description": "Create a small orchestration hook (e.g., `useAdminBootstrapOnLogin`) that: (1) detects successful Internet Identity authentication, (2) checks `useIsCallerAdmin()` state, (3) triggers the admin-claim mutation at most once per identity session when not admin (or admin status is not yet known), (4) invalidates/refetches `['isCallerAdmin']` on success, and (5) normalizes claim errors into user-friendly English messaging for UI display. Use the authorization component guidance around login/logout cache behavior and handling authorization traps gracefully; verify the component's usage instructions before implementing. Before creating, confirm this path is allowed (not blocked by frontend.immutablePaths in SYSTEM_CONTEXT)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the bootstrap hook into the authenticated app lifecycle so it runs right after Internet Identity login becomes available (identity present) and refreshes admin-gated UI state by ensuring `['isCallerAdmin']` is invalidated/refetched. Ensure failures are surfaced with a user-friendly English message (e.g., via the existing toast system) specifically when the claim is rejected because an admin already exists. Use authorization component guidance for clearing cached data on logout and for handling authorization errors gracefully; verify the component's usage instructions before implementing. Before editing, confirm this file is not listed in frontend.immutablePaths in SYSTEM_CONTEXT."
        }
      ]
    }
  ]
}