{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rollback frontend behavior to match version 99 (remove v100 admin auto-bootstrap)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restore version 99 user-visible behavior in the frontend by removing version 100 admin auto-bootstrap side effects and ensuring admin gating relies only on existing admin status checks.",
      "acceptanceCriteria": [
        "The app builds successfully (frontend + backend) after the rollback changes are applied.",
        "User-visible behavior matches version 99 rather than version 100 for the main flows (login, navigation, dashboard, and admin access gating).",
        "No new version-100-only flows remain enabled (e.g., any admin auto-bootstrap/auto-claim logic added in v100 is removed or disabled to match v99)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the v100 admin auto-bootstrap integration: delete the useAdminBootstrap import/usage and the related toast side-effect so the app no longer attempts any automatic admin claim after Internet Identity login. Ensure admin navigation/access remains gated solely by the existing admin status check (useIsCallerAdmin), consistent with v99. This relies on the existing role-based access control behavior from the authorization component; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the v100-only React Query mutation hook that calls the backend caller self-promotion function (e.g., useClaimAdminForCaller calling becomeAdmin), so no v100 self-promotion flow remains reachable from the frontend. Keep the existing admin status query (useIsCallerAdmin) intact for UI gating. Verify the authorization component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Disable the version 100 admin auto-bootstrap flow after Internet Identity login so admin UI gating is based only on the existing admin status check (v99 behavior).",
      "acceptanceCriteria": [
        "The app no longer invokes an admin bootstrap hook after login (e.g., no automatic claim attempt / no toast tied to bootstrap error).",
        "Admin UI gating is determined only by the existing admin status check, as in version 99."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminBootstrap.ts",
          "operation": "delete",
          "description": "Delete the v100 admin bootstrap hook implementation that attempts an automatic admin claim post-login. Ensure all references are removed so the frontend compiles cleanly and no auto-claim behavior occurs. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update wiring to fully remove any invocation of the deleted admin bootstrap hook and any related UI feedback (e.g., toasts). Confirm that post-login behavior no longer includes any admin claim attempt, and that admin UI elements continue to depend only on the existing isCallerAdmin status. Verify the authorization component's usage instructions before implementing."
        }
      ]
    }
  ]
}