{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix guest auth regression and ensure shared guest session state across the app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure submitting the \"Welcome, Guest\" name form reliably transitions into the dashboard and prevents the login screen from re-appearing due to auth-state effects/rerenders; guest session must persist across refresh.",
      "acceptanceCriteria": [
        "From the main login page, clicking \"Continue as guest\" shows the full-page guest name entry step.",
        "Submitting the guest name form with a non-empty name results in the login UI disappearing and the dashboard rendering.",
        "After successful guest submit, the login page does not re-appear due to any auth-state effect/rerender.",
        "Refreshing the browser after guest login keeps the user in the app (guest session persists)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor login-vs-app rendering to be derived from current auth sources (Internet Identity + guest session) rather than relying on a potentially stale local showLogin flag; ensure guest session presence always wins over the unauthenticated effect so the login screen cannot re-appear after successful guest submit."
        },
        {
          "path": "frontend/src/hooks/useGuestAuth.ts",
          "operation": "modify",
          "description": "Update guest auth hook implementation so a guest session created during the guest-name screen is immediately observable by the App shell (same render tick/interaction), preventing bounce-back to the main login UI; keep localStorage persistence behavior for refresh."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make guest session state a shared, app-wide reactive source so all components observe guest login/logout changes immediately even when they call the guest auth hook independently, while preserving session migration behavior.",
      "acceptanceCriteria": [
        "When the guest session is created in the guest name screen, the App-level guest auth state (used to decide whether to show the login screen) updates in the same tick/interaction without requiring a full page reload.",
        "When the guest session is cleared (guest logout), the App-level guest auth state updates immediately and the login screen is shown.",
        "Guest session migration behavior (adding missing guestId to old sessions) continues to work."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/guestAuthStore.ts",
          "operation": "create",
          "description": "Implement a small shared guest-session store (module-level singleton) with subscribe/notify semantics that reads/writes localStorage, broadcasts updates to all listeners on login/logout/migration, and provides a single source of truth for the guest session."
        },
        {
          "path": "frontend/src/hooks/useGuestAuth.ts",
          "operation": "modify",
          "description": "Refactor useGuestAuth to subscribe to the shared guestAuthStore (instead of per-hook-instance useState/useEffect initialization) so multiple hook consumers stay in sync; preserve and centralize migration (adding missing guestId) so it runs once and notifies subscribers."
        },
        {
          "path": "frontend/src/components/AnonymousLogin.tsx",
          "operation": "modify",
          "description": "Adjust guest login submission flow to rely on the shared guest auth state propagation (and avoid any assumptions about independent hook instances); ensure the submit action triggers the shared store update before calling onLogin so the App shell can immediately switch away from the login UI."
        }
      ]
    }
  ]
}