{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SafeSpace aurora theme + glass login card + authenticated-only header (placeholder nav)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the top header only for authenticated Internet Identity sessions (never for unauthenticated or guest sessions).",
      "acceptanceCriteria": [
        "When not authenticated and not in guest mode, the app shows the AnonymousLogin screen with no header present.",
        "When in guest mode, the app does not render the Header component anywhere in the layout.",
        "When authenticated, the header is visible at the top of the app and remains sticky."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update layout gating so <Header /> is rendered only when Internet Identity is authenticated (identity present), and is not rendered for guest sessions; keep existing page rendering and non-header navigation behavior intact."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restyle the authenticated header to match the SafeSpace spec (logo/wordmark, centered placeholder nav, right-side profile/robot icons, outlined logout).",
      "acceptanceCriteria": [
        "Header background is solid white with subtle separation (border or shadow) from the aurora background.",
        "Left side shows the SafeSpace logo mark and wordmark consistent with existing BrandLogo assets.",
        "Center nav visually matches: Home appears as a pill with heart icon; other items have black icon + black label text.",
        "Right side shows two purple circular icons (profile and alien/robot) and a Logout button with black border and an exit/arrow icon.",
        "Logout triggers the existing logout/clear behavior and clears React Query cache as it currently does."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Redesign Header markup and styling hooks to match the provided SafeSpace header spec (solid white strip, BrandLogo on left, centered placeholder nav styling, and right-side purple circular profile + robot/alien icons plus outlined Logout with exit icon). Use shadcn-ui Button where appropriate (Verify the component's usage instructions before implementing). Preserve existing logout/clear + React Query cache clear behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/add CSS utility classes for the new header presentation (white strip separation, Home pill styling with heart icon, black icon+label styling for other items, purple circular icon buttons, outlined logout button). Ensure header separation remains subtle over the aurora background."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make header center navigation items visual placeholders only (no route/page changes on click).",
      "acceptanceCriteria": [
        "Clicking 'Home', 'AI Companion', 'Mood Tracker', or 'My History' in the header does not change the currently displayed page/content.",
        "The nav items still have appropriate visual affordances (consistent styling) without implying functional navigation (e.g., no active-route switching behavior).",
        "Existing non-header navigation (e.g., Dashboard actions) continues to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove/disable calls that change app page state from header center nav item clicks; render the items as styled, non-navigating placeholders (no active-route switching). Keep all existing non-header navigation paths unchanged. Use shadcn-ui Button as the visual affordance if retained (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Implement a CSS-only aurora background with diagonal violet/magenta/purple streaks, electric cyan accents, soft blooms, and subtle motion.",
      "acceptanceCriteria": [
        "The main app background uses CSS (gradients/blur/overlays/animations) and not a static image file.",
        "The palette includes visible electric cyan accents in addition to violet/magenta/purple.",
        "The background reads as diagonally flowing aurora streaks with soft bloom patches, and has subtle animated movement without being distracting."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Enhance the existing .aurora-bg CSS gradient stack to more clearly show diagonal aurora-like streaks and add visible electric cyan accents (in addition to violet/magenta/purple), keeping motion subtle (refine existing keyframes/pseudo-element overlays without introducing any static background image)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Match the unauthenticated login screen to the specified centered glassmorphism card design with correct text, buttons, and terms gating.",
      "acceptanceCriteria": [
        "The login card is centered and has a white frosted/glass look with a soft glow that separates it from the aurora background.",
        "Primary button shows a purple-to-magenta gradient and includes a sparkle icon next to the label.",
        "Secondary button is white with a glowing purple outline and black label text.",
        "Internet Identity login remains gated by the terms checkbox (must be checked to enable login).",
        "All user-facing text is in English and uses the corrected phrasing for the terms agreement sentence/links."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AnonymousLogin.tsx",
          "operation": "modify",
          "description": "Refine the login layout to fully match the described glassmorphism card and content order (logo, purple heading, subheading, gradient primary button with sparkle icon, OR divider, outlined guest button, and corrected terms agreement text/links). Continue using shadcn-ui Card/Button/Checkbox components (Verify the component's usage instructions before implementing) and keep the checkbox gating for Internet Identity login."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Tune the glass login card look (frosted white translucency + soft outer glow), primary gradient button styling, and guest outline glow styling to match the spec while keeping the existing aurora background visible behind the blur."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add a decorative bottom-left translucent purple circular user-silhouette accent on the login screen.",
      "acceptanceCriteria": [
        "On the login screen, a decorative bottom-left translucent purple circle is partially off-screen/peeking in and includes a user silhouette icon.",
        "The element does not block interaction with the login card or buttons (pointer-events disabled)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AnonymousLogin.tsx",
          "operation": "modify",
          "description": "Add an absolutely positioned, bottom-left, partially off-screen decorative element containing a user silhouette icon; ensure it is translucent purple, purely decorative, and has pointer-events disabled so it cannot block interactions."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add CSS classes for the login bottom-left corner accent (positioning, translucency, partial off-screen peek, blur/glow as needed) and ensure pointer-events are disabled."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Use existing generated SafeSpace logo images as static frontend assets via BrandLogo (no backend serving).",
      "acceptanceCriteria": [
        "BrandLogo renders images from /assets/generated/safespace-logo.dim_64x64.png and /assets/generated/safespace-logo.dim_256x256.png.",
        "No backend endpoints are added or used to serve logo images."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BrandLogo.tsx",
          "operation": "modify",
          "description": "Confirm BrandLogo continues to load the static generated logo assets from frontend/public/assets/generated/safespace-logo.dim_64x64.png and frontend/public/assets/generated/safespace-logo.dim_256x256.png, and align wordmark styling to the SafeSpace header spec (purple sans-serif, capitalized if required) without introducing any backend image fetching."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure the header uses BrandLogo for the left-aligned logo/wordmark so the static assets are visibly present in authenticated sessions; keep all image usage as static frontend assets."
        },
        {
          "path": "frontend/src/components/AnonymousLogin.tsx",
          "operation": "modify",
          "description": "Ensure the login card renders the same BrandLogo logo mark at the top so the static generated assets are used on the unauthenticated screen as well. Use shadcn-ui Card layout as already present (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}